# PanelTypeSet Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelTypeSet Class
Members See Also
---
A set that contains panel types.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class PanelTypeSet : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class PanelTypeSet _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class PanelTypeSet : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..PanelTypeSet
# See Also
PanelTypeSet Members
Autodesk.Revit.DB Namespace